Repository: ghislainleblanc/ClaudeSwitch
Catalog: Claude Switch/Claude Switch/Localizable.xcstrings
Source language: en
Languages: fr

# error.claudeNotInstalled
source: Claude Desktop is not installed.
fr: Claude Desktop n’est pas installé.

# error.noSnapshotFormat
source: No saved session for the %@ profile.
fr: Aucune session enregistrée pour le profil %@.

# error.recoveryFailed
source: Couldn’t repair an interrupted switch. Check ~/Library/Application Support/Claude Switch.
fr: Impossible de réparer un changement interrompu. Vérifiez ~/Library/Application Support/Claude Switch.

# error.quitTimedOut
source: Claude Desktop did not quit in time. Quit it manually, then try again.
fr: Claude Desktop ne s’est pas fermé à temps. Fermez-le manuellement, puis réessayez.

# menu.quit
source: Quit Claude Switch
fr: Quitter Claude Switch

# profile.active
source: Active
fr: Actif

# profile.lastSavedFormat
source: Saved %@
fr: Enregistrée le %@

# profile.notSavedYet
source: No saved session yet — you’ll sign in after switching
fr: Aucune session enregistrée — vous devrez vous connecter après le changement

# profile.personal
source: Personal
fr: Personnel

# profile.work
source: Work
fr: Travail

# setup.explanation
source: Claude Switch saves the current session under the profile you pick, then lets you flip between your personal and work accounts in one click.
fr: Claude Switch enregistre la session actuelle sous le profil choisi, puis vous permet de basculer entre vos comptes personnel et professionnel en un clic.

# setup.question
source: Which account is Claude Desktop signed in to right now?
fr: À quel compte Claude Desktop est-il connecté en ce moment ?

# status.failureFormat
source: Failed: %@
fr: Échec : %@

# status.savingFormat
source: Saving the current session to %@…
fr: Enregistrement de la session actuelle dans le profil %@…

# status.sessionMismatch
source: The current Claude Desktop session doesn’t match the saved profiles. Pick the account that is signed in:
fr: La session actuelle de Claude Desktop ne correspond pas aux profils enregistrés. Choisissez le compte connecté :

# status.signInRequiredFormat
source: Sign in to your %@ account in Claude Desktop.
fr: Connectez-vous à votre compte %@ dans Claude Desktop.

# status.switchedFormat
source: Now using the %@ profile
fr: Profil %@ actif

# status.switchingFormat
source: Switching to %@…
fr: Passage au profil %@…
